[
  {
    "id": "chancellor-1",
    "name": "Dr. Jendayi Elizabeth Frazer",
    "title": "Chancellor, Riara University",
    "role": "chancellor",
    "bio": "Dr. Jendayi Elizabeth Frazer, the 2nd Chancellor of Riara University, is a distinguished diplomat, accomplished academic, celebrated educationist, visionary entrepreneur, and renowned Africanist. Her appointment marks a historic chapter for the university, as she becomes the first woman to hold this esteemed position. Dr. Frazer is the President and CEO of 50 Ventures, a private consulting and investment firm committed to elevating Africa's global standing through strategic investments in governance, education, enterprise, and stability sectors. She is also a Duignan Distinguished Visiting Fellow at the Hoover Institution, Stanford University. From 2009 to 2014, she served as a Distinguished Public Service Professor at Carnegie Mellon University's Heinz College, where she also directed the Center for International Policy and Innovation (CIPI). Her research and leadership focused on advancing regional security, political and economic integration in Africa, and applying innovative technologies to development challenges. Dr. Frazer has held several high-ranking roles in the U.S. government, including U.S. Assistant Secretary of State for African Affairs (2005–2009), U.S. Ambassador to South Africa — the first woman to hold this role (August 3, 2004 to August 26, 2005), and Special Assistant to the President and Senior Director for African Affairs at the National Security Council (2001–2004). Her achievements have earned her multiple accolades, including the U.S. Secretary of State's Distinguished Service Medal (the highest civilian award by the Secretary of State); the Dame Grand Commander in the Humane Order of African Redemption from Liberia's President Ellen Johnson Sirleaf; and the Distinguished Leadership Award from Boston University's African Presidential Archives and Research Center. An alumna of Stanford University, Dr. Frazer holds a BA in Political Science and African and Afro-American Studies, dual MAs in International Policy Studies and International Development Education, and a PhD in Political Science, all from Stanford University. She also earned an MBA from the American University. With vast experience spanning diplomacy, academia, policy, and investment, Dr. Frazer continues to champion initiatives that drive Africa's transformation. Her enduring commitment to higher education is exemplified by her significant contributions in the establishment of the Carnegie Mellon University in Kigali, Rwanda, and her longstanding relationship with Riara University, having served as the Keynote Speaker during our 2nd Commencement Ceremony in 2018. Dr. Frazer's visionary leadership and unwavering passion for Africa, education, and innovation, position her as a guiding force in shaping Riara University's future.",
    "email": "chancellor@riarauniversity.ac.ke",
    "phone": "+254 703 038 000",
    "office": "Chancellor's Office, Main Administration Building",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2025/07/Picture3.jpg",
    "order": 1
  },
  {
    "id": "vc-1",
    "name": "Prof. Gateru",
    "title": "Vice Chancellor",
    "role": "vc",
    "bio": "Professor Gateru brings extensive experience in higher education leadership and academic excellence. With a distinguished career spanning over three decades, he has been instrumental in shaping Riara University's vision of nurturing innovators.",
    "email": "vc@riarauniversity.ac.ke",
    "phone": "+254 703 038 001",
    "office": "Main Administration Building, 2nd Floor",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2024/01/Prof.-Gateru-MGT-Page.jpg",
    "order": 1
  },
  {
    "id": "dvc-academic",
    "name": "Prof. Wanja Tenambergen",
    "title": "Deputy Vice Chancellor - Academic Affairs",
    "role": "deputy-vc",
    "bio": "Professor Wanja Tenambergen oversees all academic programs and ensures the highest standards of teaching and learning across the university. With over 25 years of experience in academia, she has been pivotal in curriculum development and quality assurance initiatives.",
    "email": "dvc.academic@riarauniversity.ac.ke",
    "phone": "+254 703 038 002",
    "office": "Main Administration Building, 1st Floor",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2024/01/Prof.-Wanja-MGT-Page.jpg",
    "order": 1
  }
]
