[
  {
    "id": "1",
    "category": "University Milestone",
    "title": "Riara University Awarded Charter by President William Ruto",
    "subtitle": "Historic recognition marks transition to fully accredited institution",
    "excerpt": "On March 19, 2025, Riara University was granted a Charter by President William Ruto at State House, Nairobi, marking a historic milestone in the university's journey.",
    "content": "On March 19, 2025, Riara University was granted a Charter by President William Ruto at State House, Nairobi. This recognition marks the university's transition to a fully accredited higher learning institution, affirming its commitment to academic excellence and institutional independence. The Charter award ceremony was attended by university leadership, faculty, students, and distinguished guests. This milestone represents years of dedication to providing quality education and demonstrates Riara University's readiness to contribute significantly to Kenya's higher education landscape. The Charter enables the university to operate with full autonomy while maintaining the highest standards of academic integrity and excellence.",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2025/05/char.jpg",
    "link": "https://riarauniversity.ac.ke/charter-award-press-release/",
    "featured": true,
    "publishedDate": "Mar 19, 2025",
    "author": "University Communications"
  },
  {
    "id": "2",
    "category": "Partnerships",
    "title": "Riara University Partners with IFC on Employability Program",
    "subtitle": "Enhancing graduate employability and entrepreneurship in Kenya",
    "excerpt": "Riara University has partnered with the International Finance Corporation (IFC) under the Vitae Employability Program to enhance graduate employability and foster entrepreneurship.",
    "content": "In October 2025, Riara University partnered with the International Finance Corporation (IFC) under the Vitae Employability Program. This collaboration aims to enhance graduate employability and foster entrepreneurship in Kenya by aligning academic programs with labor market needs and supporting students in building career skills. The partnership focuses on bridging the gap between education and employment, ensuring that Riara graduates are well-prepared for the job market. Through this initiative, students will have access to career development resources, mentorship programs, and opportunities to connect with potential employers. The program also emphasizes entrepreneurship, encouraging students to develop innovative solutions and start their own businesses.",
    "imageUrl": "https://www.vitaeready.org/wp-content/uploads/2025/10/IMG_2465-scaled.jpg",
    "link": "https://www.vitaeready.org/learning-hub/riara-university-partnership/",
    "publishedDate": "Oct 2025",
    "author": "Partnerships Office"
  },
  {
    "id": "3",
    "category": "Innovation",
    "title": "Riara University Signs Commercialization and Entrepreneurship Masterplan",
    "subtitle": "Partnership with KeNIA to foster innovation and entrepreneurship",
    "excerpt": "Riara University signed a masterplan with the Kenya National Innovation Agency (KeNIA) during the Kenya Innovation Week 2024.",
    "content": "In November 2024, Riara University signed a masterplan with the Kenya National Innovation Agency (KeNIA) during the Kenya Innovation Week. This partnership focuses on fostering innovation, promoting entrepreneurship, and accelerating the commercialization of creative ideas and technologies within the university. The masterplan establishes a framework for supporting student and faculty innovations, providing resources for startup development, and creating pathways for research commercialization. This initiative aligns with Riara University's vision to become a leading innovation and startup-driven university in Africa, creating an ecosystem where innovative ideas can flourish and transform into viable businesses.",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2024/12/MOU-Signing-Cover-Page.jpg",
    "link": "https://riarauniversity.ac.ke/riara-university-signs-commercialization-and-entrepreneurship-masterplan-at-kenya-innovation-week-2024/",
    "publishedDate": "Nov 2024",
    "author": "Innovation Office"
  },
  {
    "id": "4",
    "category": "Innovation",
    "title": "Riara, A Hub of Innovations",
    "subtitle": "Guest lecture on thriving innovation and startup ecosystems",
    "excerpt": "The School of Computing Sciences hosted Professor Prabhu Rajagopal from IIT Madras for a talk on innovation and startup ecosystems.",
    "content": "In June 2025, the School of Computing Sciences hosted Professor Prabhu Rajagopal from IIT Madras, who delivered a talk on thriving innovation and startup ecosystems. The session emphasized the importance of fostering an entrepreneurial mindset among students and creating an environment where innovation can flourish. Professor Rajagopal shared insights from IIT Madras's successful innovation ecosystem, highlighting best practices for nurturing startups and supporting student entrepreneurs. The lecture inspired students and faculty to think creatively about solving real-world problems and building sustainable businesses. This event is part of Riara University's ongoing commitment to becoming a hub of innovation in Kenya and Africa.",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2025/06/asd-3.jpg",
    "link": "https://riarauniversity.ac.ke/riara-a-hub-of-innovations/",
    "publishedDate": "Jun 2025",
    "author": "School of Computing Sciences"
  },
  {
    "id": "5",
    "category": "Campus Development",
    "title": "Riara University Commences Construction of New Campus at Konza Technopolis",
    "subtitle": "Kshs 20 billion investment in state-of-the-art facilities",
    "excerpt": "Riara University has commenced the construction of a new campus at Konza Technopolis, with an estimated investment of Kshs 20 billion.",
    "content": "Riara University has commenced the construction of a new campus at Konza Technopolis, with an estimated investment of Kshs 20 billion. The new campus is expected to become the university's main campus, aligning with its vision to become a leading innovation and startup-driven university in Africa. The Konza Technopolis location positions Riara University at the heart of Kenya's technology and innovation hub, providing students with access to cutting-edge facilities and opportunities to collaborate with tech companies and startups. The new campus will feature modern classrooms, research laboratories, innovation centers, and student accommodation facilities designed to support the university's mission of nurturing innovators.",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2025/12/1231313-409x258.jpg",
    "link": "#",
    "publishedDate": "2025",
    "author": "Campus Development"
  },
  {
    "id": "6",
    "category": "Technology",
    "title": "Riara University Launches Cybersecurity Training Hub",
    "subtitle": "ARU Hub strengthens Kenya's defense against cyber threats",
    "excerpt": "The university launched the Acyberschool Riara University (ARU) Hub, a center dedicated to training professionals in cybersecurity.",
    "content": "In December 2023, the university launched the Acyberschool Riara University (ARU) Hub, a center dedicated to training professionals in cybersecurity. This initiative aims to bolster the country's defense against increasing and sophisticated cyber threats. The ARU Hub provides comprehensive cybersecurity training programs, equipping professionals with the skills needed to protect digital infrastructure and data. The hub offers both short-term courses and long-term certification programs, making cybersecurity education accessible to a wide range of professionals. This initiative reflects Riara University's commitment to addressing critical technology challenges and contributing to Kenya's digital security landscape.",
    "imageUrl": "https://riarauniversity.ac.ke/wp-content/uploads/2025/11/huawei-409x258.png",
    "link": "#",
    "publishedDate": "Dec 2023",
    "author": "School of Computing Sciences"
  }
]
